In [1]:
import numpy as np
import pandas as pd

In [3]:
dict1={
    "name":["rohan","seema","mahesh","shruti"],
    "marks":[9,55,67,98],
    "city":["delhi","jaipur","rampur","barilly"]
}

In [5]:
df=pd.DataFrame(dict1)

In [6]:
df

     name  marks     city
0   rohan      9    delhi
1   seema     55   jaipur
2  mahesh     67   rampur
3  shruti     98  barilly

In [7]:
df.index=[1,2,3,4]

In [8]:
df

     name  marks     city
1   rohan      9    delhi
2   seema     55   jaipur
3  mahesh     67   rampur
4  shruti     98  barilly

In [10]:
ser=pd.Series(np.random.rand(20))

In [11]:
ser

0     0.780661
1     0.936049
2     0.335419
3     0.028937
4     0.104877
5     0.210579
6     0.062300
7     0.318126
8     0.027697
9     0.138232
10    0.298214
11    0.127692
12    0.237064
13    0.683333
14    0.653854
15    0.839222
16    0.430020
17    0.436272
18    0.881356
19    0.906138
dtype: float64

In [12]:
type(ser)

pandas.Series

In [13]:
newdf=pd.DataFrame(np.random.rand(334,5))

In [14]:
newdf

            0         1         2         3         4
0    0.064567  0.029897  0.209417  0.444283  0.344426
1    0.929721  0.799536  0.376735  0.897790  0.415716
2    0.530410  0.845866  0.023893  0.089495  0.736403
3    0.825263  0.417128  0.420235  0.643878  0.010244
4    0.846739  0.582274  0.485507  0.287160  0.406208
..        ...       ...       ...       ...       ...
329  0.298142  0.582516  0.004717  0.999819  0.693383
330  0.035340  0.725603  0.689305  0.293476  0.919699
331  0.450583  0.023867  0.172915  0.239261  0.845496
332  0.402856  0.595360  0.870613  0.852310  0.651601
333  0.757996  0.641758  0.779237  0.225954  0.659756

[334 rows x 5 columns]

In [15]:
newdf.tail(3)

            0         1         2         3         4
331  0.450583  0.023867  0.172915  0.239261  0.845496
332  0.402856  0.595360  0.870613  0.852310  0.651601
333  0.757996  0.641758  0.779237  0.225954  0.659756

In [17]:
newdf.sort_index(axis=0)

            0         1         2         3         4
0    0.064567  0.029897  0.209417  0.444283  0.344426
1    0.929721  0.799536  0.376735  0.897790  0.415716
2    0.530410  0.845866  0.023893  0.089495  0.736403
3    0.825263  0.417128  0.420235  0.643878  0.010244
4    0.846739  0.582274  0.485507  0.287160  0.406208
..        ...       ...       ...       ...       ...
329  0.298142  0.582516  0.004717  0.999819  0.693383
330  0.035340  0.725603  0.689305  0.293476  0.919699
331  0.450583  0.023867  0.172915  0.239261  0.845496
332  0.402856  0.595360  0.870613  0.852310  0.651601
333  0.757996  0.641758  0.779237  0.225954  0.659756

[334 rows x 5 columns]

In [18]:
newdf.drop(0,axis=1)

            1         2         3         4
0    0.029897  0.209417  0.444283  0.344426
1    0.799536  0.376735  0.897790  0.415716
2    0.845866  0.023893  0.089495  0.736403
3    0.417128  0.420235  0.643878  0.010244
4    0.582274  0.485507  0.287160  0.406208
..        ...       ...       ...       ...
329  0.582516  0.004717  0.999819  0.693383
330  0.725603  0.689305  0.293476  0.919699
331  0.023867  0.172915  0.239261  0.845496
332  0.595360  0.870613  0.852310  0.651601
333  0.641758  0.779237  0.225954  0.659756

[334 rows x 4 columns]

In [19]:
newdf.dropna(inplace=True)